app/controllers/inventory_controller.rb

SELECT `caroptions`.* FROM `caroptions` WHERE (VIN = '01D932ASMHYL5NQR5')
---
  def lookupVIN

    lops = Caroption.where("VIN = " + "'" + params['VIN']+ "'")

SELECT `inventories`.* FROM `inventories`
---
  def clientoldie
    @inventorys = Inventory.all

SELECT `INVENTORY`.* FROM `INVENTORY`
SELECT `inventories`.* FROM `inventories`
---
  def client
    @inventorys = Inventory.all